let company = [
  { name: 'Samsung', employees: '287439'},
  { name: 'Apple', employees: '137000' },
  { name: 'Microsoft', employees: '144000' },
  { name: 'Honda', employees: '208235' },
  { name: 'Alibaba', employees: '117600' },
];

// Задание 1
// Написать ФУНКЦИЮ, которая выводит в консоль все элементы массива в виде "Название компании: Samsing, работников: 287 439 человек"

// Задание 2
// Написать ФУНКЦИЮ, которая берёт у пользователя название компании и выводит её численность в консоль
// Если такой компании нету, вывести в консоль "Компания не найдена"

// Задание 3
// Написать ФУНКЦИЮ, которая выводит в консоль названия компании, чья численность меньше 150 000 работников

// Задание 4
// Написать ФУНКЦИЮ, которая берёт у пользователя два значения:
// 1. Название компании
// 2. Численность
// Изменить численность той компаний, которой ввёл пользователь на ту численность, которую ввел пользователь

// Задание 5
// Написать ФУНКЦИЮ, которая которая берёт у пользователя значение, которое будет ключём.
// Вывести в консоль все значения ключа, который ввел пользователь
// Пример: 
// Пользователь ввёл "name"
// В консоль должно вывести "Samsung, Apple, ... Alibaba" в одну строчку